# Selecting, Filtering, and Sorting Data

## Indexing
- Basics: single rows and columns
- Indexing with slices and lists
- using loc and iloc

## Boolean Fitlering

## Assigning values with Indexing

## Sorting

In [75]:
import numpy as np
import pandas as pd
df = pd.read_csv('./course_material/03/demos/m2_exploring_data/weather.csv').head()
df

   MONTH  DAY  TIME  TEMP  PRESSURE
0      1    1     1   6.8     10207
1      1    1     2   5.8     10214
2      1    1     3   5.7     10220
3      1    1     4   6.0     10225
4      1    1     5   4.5     10230

In [76]:
df['TEMP']

0    6.8
1    5.8
2    5.7
3    6.0
4    4.5
Name: TEMP, dtype: float64

In [77]:
df['TEMP'][1]

5.8

In [78]:
# Don't use this
df.TEMP

0    6.8
1    5.8
2    5.7
3    6.0
4    4.5
Name: TEMP, dtype: float64

## Simple Indexing

In [79]:
dft = df.T
dft

                0        1        2        3        4
MONTH         1.0      1.0      1.0      1.0      1.0
DAY           1.0      1.0      1.0      1.0      1.0
TIME          1.0      2.0      3.0      4.0      5.0
TEMP          6.8      5.8      5.7      6.0      4.5
PRESSURE  10207.0  10214.0  10220.0  10225.0  10230.0

In [80]:
dft[2]['TIME']

3.0

In [81]:
# Same as above, 2 is the index for the Time Row
dft[2][2]

3.0

In [82]:
t = pd.DataFrame([['John'], ['Bob'], ['Anne']], index=[4,3,4])
t

      0
4  John
3   Bob
4  Anne

In [83]:
t[0][4]

4    John
4    Anne
Name: 0, dtype: object

In [84]:
t[0][4].info()

<class 'pandas.core.series.Series'>
Int64Index: 2 entries, 4 to 4
Series name: 0
Non-Null Count  Dtype
--------------  -----
2 non-null      object
dtypes: object(1)
memory usage: 32.0+ bytes

## Indexing with lists and slices

In [85]:
df

   MONTH  DAY  TIME  TEMP  PRESSURE
0      1    1     1   6.8     10207
1      1    1     2   5.8     10214
2      1    1     3   5.7     10220
3      1    1     4   6.0     10225
4      1    1     5   4.5     10230

In [86]:
df[['PRESSURE', 'TIME', 'TEMP']]

   PRESSURE  TIME  TEMP
0     10207     1   6.8
1     10214     2   5.8
2     10220     3   5.7
3     10225     4   6.0
4     10230     5   4.5

In [87]:
df['TIME'][[3, 1, 4]]

3    4
1    2
4    5
Name: TIME, dtype: int64

In [88]:
df[2:4][['TEMP', 'PRESSURE']]

   TEMP  PRESSURE
2   5.7     10220
3   6.0     10225

In [89]:
dft

                0        1        2        3        4
MONTH         1.0      1.0      1.0      1.0      1.0
DAY           1.0      1.0      1.0      1.0      1.0
TIME          1.0      2.0      3.0      4.0      5.0
TEMP          6.8      5.8      5.7      6.0      4.5
PRESSURE  10207.0  10214.0  10220.0  10225.0  10230.0

In [90]:
dft[3:][[2,3]]

                2        3
TEMP          5.7      6.0
PRESSURE  10220.0  10225.0

In [91]:
df['PRESSURE'][:4]

0    10207
1    10214
2    10220
3    10225
Name: PRESSURE, dtype: int64

In [92]:
dft[:2]

         0    1    2    3    4
MONTH  1.0  1.0  1.0  1.0  1.0
DAY    1.0  1.0  1.0  1.0  1.0

In [93]:
dft['TIME':'PRESSURE']

                0        1        2        3        4
TIME          1.0      2.0      3.0      4.0      5.0
TEMP          6.8      5.8      5.7      6.0      4.5
PRESSURE  10207.0  10214.0  10220.0  10225.0  10230.0

## Using loc and iLoc

In [94]:
capitals = pd.DataFrame(
    [
    ["Ngerulmud",391,1.87],
    ["Vatican City",826,100],
    ["Yaren",1100,10.91],
    ["Funafuti",4492,45.48],
    ["City of San Marino",4493]
    ], 
    index = ["Palau", "Vatican City", "Nauru", "Tuvalu", "San Marino"],
    columns=['Capital', 'Population', 'Percentage'])

In [95]:
capitals

                         Capital  Population  Percentage
Palau                  Ngerulmud         391        1.87
Vatican City        Vatican City         826      100.00
Nauru                      Yaren        1100       10.91
Tuvalu                  Funafuti        4492       45.48
San Marino    City of San Marino        4493         NaN

In [96]:
capitals.loc['Nauru', 'Population']

1100

In [97]:
capitals['Population']['Nauru']

1100

In [98]:
capitals.loc['Palau':'Nauru', ['Population', 'Percentage']]

              Population  Percentage
Palau                391        1.87
Vatican City         826      100.00
Nauru               1100       10.91

In [99]:
capitals.loc[['San Marino', 'Vatican City']]

                         Capital  Population  Percentage
San Marino    City of San Marino        4493         NaN
Vatican City        Vatican City         826       100.0

In [100]:
capitals.iloc[[4,1], 1:]

              Population  Percentage
San Marino          4493         NaN
Vatican City         826       100.0

In [101]:
capitals.iloc[:,2]

Palau             1.87
Vatican City    100.00
Nauru            10.91
Tuvalu           45.48
San Marino         NaN
Name: Percentage, dtype: float64

# Indexing: Single Value
### Retrieve a column by label
- This returns a Series
- If column index has type string `df['col_name']`
- If column index has type int `df[5]`

### Retrieve cell from column and row
- `df['col_name']['row_name']`

## Indexing: Lists and Slices

### Retrieve multiple columns in any order
- This returns a DataFrame `df[['Time', 'Temp', 'Pressure']]`

### Slices return rows, not columns
- Also returns a DataFrame `df[2:35]`
- Also works with labeols `capitals['Palau':'Nauru']`

## Indexing: loc

### DataFrame.lco does row-based indexing with labels
- Retrieve a single row: `df.loc['San Marino']`

### Select column in the same operations
- `df.loc['San Marino', 'Population']`

### compare
- `df['Population']['San Marino']`

## Indexing: iloc

### DateFrame.iloc does row-based indexing by position
- Retrieve a single row `df.iloc[5]`

### Select column in the same operations
- `df.ilocp[4, 2]`

### loc and iloc also support lists and slices

## Boolean Filtering

In [102]:
capitals[['Capital', 'Population']]

                         Capital  Population
Palau                  Ngerulmud         391
Vatican City        Vatican City         826
Nauru                      Yaren        1100
Tuvalu                  Funafuti        4492
San Marino    City of San Marino        4493

In [103]:
# selecting first 2 rows, skipping the third, selecting the 4th and skipping the fifth
# shows we can set conditions to show rows
capitals[[True, True, False, True, False]]

                   Capital  Population  Percentage
Palau            Ngerulmud         391        1.87
Vatican City  Vatican City         826      100.00
Tuvalu            Funafuti        4492       45.48

In [104]:
capitals['Percentage'] > 25

Palau           False
Vatican City     True
Nauru           False
Tuvalu           True
San Marino      False
Name: Percentage, dtype: bool

In [105]:
capitals[capitals['Percentage'] > 25]

                   Capital  Population  Percentage
Vatican City  Vatican City         826      100.00
Tuvalu            Funafuti        4492       45.48

In [106]:
grades = pd.DataFrame([[6, 4], [7, 8], [6, 7], [6, 5], [5, 2]], 
                       index = ['Mary', 'John', 'Ann', 'Pete', 'Laura'],
                       columns = ['test_1', 'test_2'])
grades.astype('int32')

       test_1  test_2
Mary        6       4
John        7       8
Ann         6       7
Pete        6       5
Laura       5       2

In [107]:
grades['test_2'] <= grades['test_1']

Mary      True
John     False
Ann      False
Pete      True
Laura     True
dtype: bool

In [108]:
grades[grades['test_2'] <= grades['test_1']]

       test_1  test_2
Mary        6       4
Pete        6       5
Laura       5       2

In [109]:
grades.mean() > 5.5

test_1     True
test_2    False
dtype: bool

In [110]:
grades.loc[:, grades.mean() > 5.5]

       test_1
Mary        6
John        7
Ann         6
Pete        6
Laura       5

## Assigning values

In [111]:
grades

       test_1  test_2
Mary        6       4
John        7       8
Ann         6       7
Pete        6       5
Laura       5       2

In [112]:
grades.loc[['Laura', 'John'], 'test_2'] += 1

In [113]:
grades

       test_1  test_2
Mary        6       4
John        7       9
Ann         6       7
Pete        6       5
Laura       5       3

In [114]:
grades['test_1'] += .5
grades

       test_1  test_2
Mary      6.5       4
John      7.5       9
Ann       6.5       7
Pete      6.5       5
Laura     5.5       3

In [115]:
grades.loc['Mary'] += 2
grades

       test_1  test_2
Mary      8.5       6
John      7.5       9
Ann       6.5       7
Pete      6.5       5
Laura     5.5       3

In [116]:
grades.loc['Pete'] = [7, 8]
grades

       test_1  test_2
Mary      8.5       6
John      7.5       9
Ann       6.5       7
Pete      7.0       8
Laura     5.5       3

In [117]:
grades.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Mary to Laura
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   test_1  5 non-null      float64
 1   test_2  5 non-null      int64
dtypes: float64(1), int64(1)
memory usage: 292.0+ bytes

In [118]:
failing = grades < 6
passing = grades >= 6


grades[failing] = "Fail"
grades[passing] = "Pass"
grades

      test_1 test_2
Mary    Pass   Pass
John    Pass   Pass
Ann     Pass   Pass
Pete    Pass   Pass
Laura   Fail   Fail

In [120]:
grades = pd.DataFrame([[6, 4], [7, 8], [6, 7], [6, 5], [5, 2]], 
                       index = ['Mary', 'John', 'Ann', 'Pete', 'Laura'],
                       columns = ['test_1', 'test_2'])
grades.astype('int64')

       test_1  test_2
Mary        6       4
John        7       8
Ann         6       7
Pete        6       5
Laura       5       2

In [123]:
grades['passed'] = grades.mean(axis=1) > 6

In [124]:
grades

       test_1  test_2  passed
Mary        6       4   False
John        7       8    True
Ann         6       7    True
Pete        6       5   False
Laura       5       2   False

In [125]:
grades['Ann', 'test_2'] = 8

In [126]:
grades.loc['Ann', 'test_2'] = 8

In [128]:
# Better not do this - use loc
grades['test_2']['Ann'] = 9

C:\Users\dusty\AppData\Local\Temp\ipykernel_20312\380126685.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  grades['test_2']['Ann'] = 9

In [129]:
grades

       test_1  test_2  passed  (Ann, test_2)
Mary        6       4   False              8
John        7       8    True              8
Ann         6       9    True              8
Pete        6       5   False              8
Laura       5       2   False              8

## Sorting

In [130]:
capitals.sort_index(inplace=True, ascending=False)
capitals

                         Capital  Population  Percentage
Vatican City        Vatican City         826      100.00
Tuvalu                  Funafuti        4492       45.48
San Marino    City of San Marino        4493         NaN
Palau                  Ngerulmud         391        1.87
Nauru                      Yaren        1100       10.91

In [131]:
capitals.sort_index(axis=1)

                         Capital  Percentage  Population
Vatican City        Vatican City      100.00         826
Tuvalu                  Funafuti       45.48        4492
San Marino    City of San Marino         NaN        4493
Palau                  Ngerulmud        1.87         391
Nauru                      Yaren       10.91        1100

In [133]:
capitals.sort_values(by='Percentage')

                         Capital  Population  Percentage
Palau                  Ngerulmud         391        1.87
Nauru                      Yaren        1100       10.91
Tuvalu                  Funafuti        4492       45.48
Vatican City        Vatican City         826      100.00
San Marino    City of San Marino        4493         NaN

In [134]:
grades.sort_values(by=['test_1', 'test_2'])

       test_1  test_2  passed  (Ann, test_2)
Laura       5       2   False              8
Mary        6       4   False              8
Pete        6       5   False              8
Ann         6       9    True              8
John        7       8    True              8

# Boolean Filtering

## Use Boolean Comparisons in indexing operations
- Retrieve all rows where column TEMP > 20 `df[df['TEMP']> 20]`

## Also works with loc and iloc
- select all columns with a mean over 6 `grades.loc[:, grades.mean() > 6]`

## Assiggning Values

### Indexing Operators allow you to assing to them
- Update an entire column or row
    - `grades['test_1'] += 1`
    - `grades.loc['Mary'] = [6, 8]`

### Also works with loc and iloc
- `grades.loc['John', ['test_1', 'test_2']] = 8`

## Assigning Values: Warning
### Assigning values may give a warning
- `grades['test_2']['Ann'] = 8`

### SettingWithCopyWarning:
- A value is trying to be set on a copy of a slice from a DataFrame
    - Did the assignment actually work?
    - Depends on the situation
    - Avoid chained indexing (use loc/iloc)

## Sorting
### Sort by index
- `capitals.sort_index()`

### sort by column
- `capitals.sort_values(by='Population')`

### Sort by multiple columns
- `grades.sort_values(by=['test_1', 'test_2'])`

## Sorting: Arguments

### Reverse Sort
-`capitals.sort_index(ascending=False)`

### Sort rows, not columns
-`capitals.sort_index(axis=1)`

### sort original datastructure, don't return a copy
-`capitals.sort_index(inplace=True)`

### All arguments work both for sort_index and sort_values